<template>
    <div class="Location">
        <div class="search">
            <img :src="searchIcon" alt="" />
            <input
                type="search"
                placeholder="搜索"
                @input="searchChange"
                v-model="searchData"
            />
        </div>
        <div v-show="searchData == ''">
            <p
                style="color:#50a9d6;margin: 10px 10px 10px 20px;"
                v-show="listShowLevel != 0"
                @click="back"
            >
                返回上一级
            </p>
            <div class="levelOne" v-show="listShowLevel == 0">
                <location-item
                    v-for="(item, index) in levelOneList"
                    :key="index"
                    :msg="item.a"
                    :isHaveChild="item.children.length"
                    @click.native="next(item.children, item.a, index)"
                />
            </div>
            <div class="levelTwo" v-show="listShowLevel == 1">
                <location-item
                    :msg="
                        levelOneList[listIndex] ? levelOneList[listIndex].a : ''
                    "
                    @click.native="next(false, levelOneList[listIndex].a)"
                />
                <location-item
                    v-for="(item, index) in levelTwoList"
                    :key="index"
                    :msg="item.a"
                    :isHaveChild="item.children.length"
                    @click.native="next(item.children, item.a, index)"
                />
            </div>
            <div class="levelThree" v-show="listShowLevel == 2">
                <location-item
                    :msg="
                        levelTwoList[listIndex] ? levelTwoList[listIndex].a : ''
                    "
                />
                <location-item
                    v-for="(item, index) in levelThreeList"
                    :key="index"
                    :msg="item.a"
                    :isHaveChild="item.children.length"
                    @click.native="next(item.children, item.a, index)"
                />
            </div>
            <div class="levelFour" v-show="listShowLevel == 3">
                <location-item
                    :msg="
                        levelThreeList[listIndex]
                            ? levelThreeList[listIndex].a
                            : ''
                    "
                />
                <location-item
                    v-for="(item, index) in levelFourList"
                    :key="index"
                    :msg="item.a"
                    :isHaveChild="item.children.length"
                    @click.native="next(item.children, item.a)"
                />
            </div>
        </div>
        <div class="search-content" v-show="searchData != ''">
            <location-item
                v-for="(item, index) in searchFilterList"
                :key="index"
                :searchMsg="item"
                @click.native="searchMsgClick(item)"
            />
        </div>
    </div>
</template>
<script>
import Vue from 'vue';
import { Collapse, CollapseItem } from 'vant';
import axios from 'axios';
import Api from '@/api';
import LocationItem from '../components/LocationItem.vue';

Vue.use(Collapse);
Vue.use(CollapseItem);
export default {
    components: {
        LocationItem
    },
    data() {
        return {
            list: [],
            // 原数据,用于测试
            originList: [
                {
                    a: [
                        {
                            a: '主楼\\',
                            i: 409171,
                            l: 272,
                            p: -1,
                            q: 0
                        }
                    ],
                    i: 409171
                },
                {
                    a: [
                        {
                            a: '副楼\\fl',
                            i: 409174,
                            l: 272,
                            p: -1,
                            q: 0
                        }
                    ],
                    i: 409174
                },
                {
                    a: [
                        {
                            a: '室外分区\\swfq',
                            i: 409429,
                            l: 528,
                            p: -1,
                            q: 0
                        }
                    ],
                    i: 409429
                },
                {
                    a: [
                        {
                            a: '一楼\\yl',
                            i: 409221,
                            l: 80,
                            p: 409171,
                            q: 5
                        },
                        {
                            a: '101\\101',
                            i: 409268,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: '102\\102',
                            i: 409269,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: '103\\103',
                            i: 409270,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: '104\\104',
                            i: 409271,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: '105\\105',
                            i: 409272,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: '106\\106',
                            i: 409273,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: '107\\107',
                            i: 409274,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: '108\\108',
                            i: 409275,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: '109\\109',
                            i: 409276,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: '110\\110',
                            i: 409277,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: '111\\111',
                            i: 409278,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A01\\A01',
                            i: 409279,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A02\\A02',
                            i: 409280,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A03\\A03',
                            i: 409281,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A04\\A04',
                            i: 409282,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A05\\A05',
                            i: 409283,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A06\\A06',
                            i: 409284,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A07\\A07',
                            i: 409285,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A08\\A08',
                            i: 409286,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A09\\A09',
                            i: 409287,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A10\\A10',
                            i: 409288,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A111\\A111',
                            i: 409291,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A112\\A112',
                            i: 409289,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A113\\A113',
                            i: 409290,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: 'A222\\A222',
                            i: 409292,
                            l: 48,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: '客用电梯外走廊\\kydtwzl',
                            i: 409222,
                            l: 32,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: '布草房\\bcf',
                            i: 409224,
                            l: 32,
                            p: 409221,
                            q: 0
                        },
                        {
                            a: '楼层走廊公区\\lczlgq',
                            i: 409223,
                            l: 32,
                            p: 409221,
                            q: 0
                        }
                    ],
                    i: 409221
                },
                {
                    a: [
                        {
                            a: '七楼\\ql',
                            i: 409327,
                            l: 80,
                            p: 409171,
                            q: 8
                        },
                        {
                            a: 'E701\\E701',
                            i: 409331,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E702\\E702',
                            i: 409332,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E703\\E703',
                            i: 409333,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E704\\E704',
                            i: 409334,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E705\\E705',
                            i: 409335,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E706\\E706',
                            i: 409336,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E707\\E707',
                            i: 409337,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E708\\E708',
                            i: 409338,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E709\\E709',
                            i: 409339,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E710\\E710',
                            i: 409340,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E711\\E711',
                            i: 409341,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E712\\E712',
                            i: 409342,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E713\\E713',
                            i: 409343,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E714\\E714',
                            i: 409344,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E715\\E715',
                            i: 409345,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E716\\E716',
                            i: 409346,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E717\\E717',
                            i: 409347,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E718\\E718',
                            i: 409348,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E719\\E719',
                            i: 409349,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E720\\E720',
                            i: 409350,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E721\\E721',
                            i: 409351,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E722\\E722',
                            i: 409352,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E723\\E723',
                            i: 409353,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E724\\E724',
                            i: 409354,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E725\\E725',
                            i: 409355,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E726\\E726',
                            i: 409356,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E727\\E727',
                            i: 409357,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E728\\E728',
                            i: 409358,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E729\\E729',
                            i: 409359,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: 'E730\\E730',
                            i: 409360,
                            l: 48,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: '客用电梯外走廊\\kydtwzl',
                            i: 409328,
                            l: 32,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: '布草房\\bcf',
                            i: 409330,
                            l: 32,
                            p: 409327,
                            q: 0
                        },
                        {
                            a: '楼层走廊公区\\lczlgq',
                            i: 409329,
                            l: 32,
                            p: 409327,
                            q: 0
                        }
                    ],
                    i: 409327
                },
                {
                    a: [
                        {
                            a: '三楼\\sl',
                            i: 409190,
                            l: 80,
                            p: 409171,
                            q: 3
                        },
                        {
                            a: '301\\301',
                            i: 409194,
                            l: 48,
                            p: 409190,
                            q: 0
                        },
                        {
                            a: '302\\302',
                            i: 409195,
                            l: 48,
                            p: 409190,
                            q: 0
                        },
                        {
                            a: '303\\303',
                            i: 409196,
                            l: 48,
                            p: 409190,
                            q: 0
                        },
                        {
                            a: '304\\304',
                            i: 409197,
                            l: 48,
                            p: 409190,
                            q: 0
                        },
                        {
                            a: '305\\305',
                            i: 409198,
                            l: 48,
                            p: 409190,
                            q: 0
                        },
                        {
                            a: '306\\306',
                            i: 409199,
                            l: 48,
                            p: 409190,
                            q: 0
                        },
                        {
                            a: '307\\307',
                            i: 409200,
                            l: 48,
                            p: 409190,
                            q: 0
                        },
                        {
                            a: '308\\308',
                            i: 409201,
                            l: 48,
                            p: 409190,
                            q: 0
                        },
                        {
                            a: '309\\309',
                            i: 409202,
                            l: 48,
                            p: 409190,
                            q: 0
                        },
                        {
                            a: '310\\310',
                            i: 409203,
                            l: 48,
                            p: 409190,
                            q: 0
                        },
                        {
                            a: '客用电梯外走廊\\kydtwzl',
                            i: 409191,
                            l: 32,
                            p: 409190,
                            q: 0
                        },
                        {
                            a: '布草房\\bcf',
                            i: 409193,
                            l: 32,
                            p: 409190,
                            q: 0
                        },
                        {
                            a: '楼层走廊公区\\lczlgq',
                            i: 409192,
                            l: 32,
                            p: 409190,
                            q: 0
                        }
                    ],
                    i: 409190
                },
                {
                    a: [
                        {
                            a: '主楼通用公区\\',
                            i: 409172,
                            l: 96,
                            p: 409171,
                            q: 0
                        }
                    ],
                    i: 409172
                },
                {
                    a: [
                        {
                            a: '九楼\\jl',
                            i: 409395,
                            l: 80,
                            p: 409171,
                            q: 10
                        },
                        {
                            a: 'G901\\G901',
                            i: 409399,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G902\\G902',
                            i: 409400,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G903\\G903',
                            i: 409401,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G904\\G904',
                            i: 409402,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G905\\G905',
                            i: 409403,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G906\\G906',
                            i: 409404,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G907\\G907',
                            i: 409405,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G908\\G908',
                            i: 409406,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G909\\G909',
                            i: 409407,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G910\\G910',
                            i: 409408,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G911\\G911',
                            i: 409409,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G912\\G912',
                            i: 409410,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G913\\G913',
                            i: 409411,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G914\\G914',
                            i: 409412,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G915\\G915',
                            i: 409413,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G916\\G916',
                            i: 409414,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G917\\G917',
                            i: 409415,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G918\\G918',
                            i: 409416,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G919\\G919',
                            i: 409417,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G920\\G920',
                            i: 409418,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G921\\G921',
                            i: 409419,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G922\\G922',
                            i: 409420,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G923\\G923',
                            i: 409421,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G924\\G924',
                            i: 409422,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G925\\G925',
                            i: 409423,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G926\\G926',
                            i: 409424,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G927\\G927',
                            i: 409425,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G928\\G928',
                            i: 409426,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G929\\G929',
                            i: 409427,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: 'G930\\G930',
                            i: 409428,
                            l: 48,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: '客用电梯外走廊\\kydtwzl',
                            i: 409396,
                            l: 32,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: '布草房\\bcf',
                            i: 409398,
                            l: 32,
                            p: 409395,
                            q: 0
                        },
                        {
                            a: '楼层走廊公区\\lczlgq',
                            i: 409397,
                            l: 32,
                            p: 409395,
                            q: 0
                        }
                    ],
                    i: 409395
                },
                {
                    a: [
                        {
                            a: '二楼\\el',
                            i: 409175,
                            l: 80,
                            p: 409171,
                            q: 2
                        },
                        {
                            a: '201\\201',
                            i: 409179,
                            l: 48,
                            p: 409175,
                            q: 0
                        },
                        {
                            a: '202\\202',
                            i: 409180,
                            l: 48,
                            p: 409175,
                            q: 0
                        },
                        {
                            a: '203\\203',
                            i: 409181,
                            l: 48,
                            p: 409175,
                            q: 0
                        },
                        {
                            a: '204\\204',
                            i: 409182,
                            l: 48,
                            p: 409175,
                            q: 0
                        },
                        {
                            a: '205\\205',
                            i: 409183,
                            l: 48,
                            p: 409175,
                            q: 0
                        },
                        {
                            a: '206\\206',
                            i: 409184,
                            l: 48,
                            p: 409175,
                            q: 0
                        },
                        {
                            a: '207\\207',
                            i: 409185,
                            l: 48,
                            p: 409175,
                            q: 0
                        },
                        {
                            a: '208\\208',
                            i: 409186,
                            l: 48,
                            p: 409175,
                            q: 0
                        },
                        {
                            a: '209\\209',
                            i: 409187,
                            l: 48,
                            p: 409175,
                            q: 0
                        },
                        {
                            a: '210\\210',
                            i: 409188,
                            l: 48,
                            p: 409175,
                            q: 0
                        },
                        {
                            a: '211\\211',
                            i: 409189,
                            l: 48,
                            p: 409175,
                            q: 0
                        },
                        {
                            a: '客用电梯外走廊\\kydtwzl',
                            i: 409176,
                            l: 32,
                            p: 409175,
                            q: 0
                        },
                        {
                            a: '布草房\\bcf',
                            i: 409178,
                            l: 32,
                            p: 409175,
                            q: 0
                        },
                        {
                            a: '楼层走廊公区\\lczlgq',
                            i: 409177,
                            l: 32,
                            p: 409175,
                            q: 0
                        }
                    ],
                    i: 409175
                },
                {
                    a: [
                        {
                            a: '五楼\\wl',
                            i: 409225,
                            l: 80,
                            p: 409171,
                            q: 6
                        },
                        {
                            a: '501\\501',
                            i: 409229,
                            l: 48,
                            p: 409225,
                            q: 0
                        },
                        {
                            a: '502\\502',
                            i: 409230,
                            l: 48,
                            p: 409225,
                            q: 0
                        },
                        {
                            a: '503\\503',
                            i: 409231,
                            l: 48,
                            p: 409225,
                            q: 0
                        },
                        {
                            a: '504\\504',
                            i: 409232,
                            l: 48,
                            p: 409225,
                            q: 0
                        },
                        {
                            a: '505\\505',
                            i: 409233,
                            l: 48,
                            p: 409225,
                            q: 0
                        },
                        {
                            a: '506\\506',
                            i: 409234,
                            l: 48,
                            p: 409225,
                            q: 0
                        },
                        {
                            a: '507\\507',
                            i: 409235,
                            l: 48,
                            p: 409225,
                            q: 0
                        },
                        {
                            a: '508\\508',
                            i: 409236,
                            l: 48,
                            p: 409225,
                            q: 0
                        },
                        {
                            a: '509\\509',
                            i: 409237,
                            l: 48,
                            p: 409225,
                            q: 0
                        },
                        {
                            a: '510\\510',
                            i: 409238,
                            l: 48,
                            p: 409225,
                            q: 0
                        },
                        {
                            a: '客用电梯外走廊\\kydtwzl',
                            i: 409226,
                            l: 32,
                            p: 409225,
                            q: 0
                        },
                        {
                            a: '布草房\\bcf',
                            i: 409228,
                            l: 32,
                            p: 409225,
                            q: 0
                        },
                        {
                            a: '楼层走廊公区\\lczlgq',
                            i: 409227,
                            l: 32,
                            p: 409225,
                            q: 0
                        }
                    ],
                    i: 409225
                },
                {
                    a: [
                        {
                            a: '八楼\\bl',
                            i: 409361,
                            l: 80,
                            p: 409171,
                            q: 9
                        },
                        {
                            a: 'F801\\F801',
                            i: 409365,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F802\\F802',
                            i: 409366,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F803\\F803',
                            i: 409367,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F804\\F804',
                            i: 409368,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F805\\F805',
                            i: 409369,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F806\\F806',
                            i: 409370,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F807\\F807',
                            i: 409371,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F808\\F808',
                            i: 409372,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F809\\F809',
                            i: 409373,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F810\\F810',
                            i: 409374,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F811\\F811',
                            i: 409375,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F812\\F812',
                            i: 409376,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F813\\F813',
                            i: 409377,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F814\\F814',
                            i: 409378,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F815\\F815',
                            i: 409379,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F816\\F816',
                            i: 409380,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F817\\F817',
                            i: 409381,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F818\\F818',
                            i: 409382,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F819\\F819',
                            i: 409383,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F820\\F820',
                            i: 409384,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F821\\F821',
                            i: 409385,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F822\\F822',
                            i: 409386,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F823\\F823',
                            i: 409387,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F824\\F824',
                            i: 409388,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F825\\F825',
                            i: 409389,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F826\\F826',
                            i: 409390,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F827\\F827',
                            i: 409391,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F828\\F828',
                            i: 409392,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F829\\F829',
                            i: 409393,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: 'F830\\F830',
                            i: 409394,
                            l: 48,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: '客用电梯外走廊\\kydtwzl',
                            i: 409362,
                            l: 32,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: '布草房\\bcf',
                            i: 409364,
                            l: 32,
                            p: 409361,
                            q: 0
                        },
                        {
                            a: '楼层走廊公区\\lczlgq',
                            i: 409363,
                            l: 32,
                            p: 409361,
                            q: 0
                        }
                    ],
                    i: 409361
                },
                {
                    a: [
                        {
                            a: '六楼\\ll',
                            i: 409293,
                            l: 80,
                            p: 409171,
                            q: 7
                        },
                        {
                            a: 'D601\\D601',
                            i: 409297,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D602\\D602',
                            i: 409298,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D603\\D603',
                            i: 409299,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D604\\D604',
                            i: 409300,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D605\\D605',
                            i: 409301,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D606\\D606',
                            i: 409302,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D607\\D607',
                            i: 409303,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D608\\D608',
                            i: 409304,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D609\\D609',
                            i: 409305,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D610\\D610',
                            i: 409306,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D611\\D611',
                            i: 409307,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D612\\D612',
                            i: 409308,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D613\\D613',
                            i: 409309,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D614\\D614',
                            i: 409310,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D615\\D615',
                            i: 409311,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D616\\D616',
                            i: 409312,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D617\\D617',
                            i: 409313,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D618\\D618',
                            i: 409314,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D619\\D619',
                            i: 409315,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D620\\D620',
                            i: 409316,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D621\\D621',
                            i: 409317,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D622\\D622',
                            i: 409318,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D623\\D623',
                            i: 409319,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D624\\D624',
                            i: 409320,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D625\\D625',
                            i: 409321,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D626\\D626',
                            i: 409322,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D627\\D627',
                            i: 409323,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D628\\D628',
                            i: 409324,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D629\\D629',
                            i: 409325,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: 'D630\\D630',
                            i: 409326,
                            l: 48,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: '客用电梯外走廊\\kydtwzl',
                            i: 409294,
                            l: 32,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: '布草房\\bcf',
                            i: 409296,
                            l: 32,
                            p: 409293,
                            q: 0
                        },
                        {
                            a: '楼层走廊公区\\lczlgq',
                            i: 409295,
                            l: 32,
                            p: 409293,
                            q: 0
                        }
                    ],
                    i: 409293
                },
                {
                    a: [
                        {
                            a: '四楼\\sl',
                            i: 409204,
                            l: 80,
                            p: 409171,
                            q: 4
                        },
                        {
                            a: '401\\401',
                            i: 409208,
                            l: 48,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '402\\402',
                            i: 409209,
                            l: 48,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '403\\403',
                            i: 409210,
                            l: 48,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '404\\404',
                            i: 409211,
                            l: 48,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '405\\405',
                            i: 409212,
                            l: 48,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '406\\406',
                            i: 409213,
                            l: 48,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '407\\407',
                            i: 409214,
                            l: 48,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '408\\408',
                            i: 409215,
                            l: 48,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '409\\409',
                            i: 409216,
                            l: 48,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '410\\410',
                            i: 409217,
                            l: 48,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '411\\411',
                            i: 409218,
                            l: 48,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '412\\412',
                            i: 409219,
                            l: 48,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '413\\413',
                            i: 409220,
                            l: 48,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '客用电梯外走廊\\kydtwzl',
                            i: 409205,
                            l: 32,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '布草房\\bcf',
                            i: 409207,
                            l: 32,
                            p: 409204,
                            q: 0
                        },
                        {
                            a: '楼层走廊公区\\lczlgq',
                            i: 409206,
                            l: 32,
                            p: 409204,
                            q: 0
                        }
                    ],
                    i: 409204
                },
                {
                    a: [
                        {
                            a: '负一楼\\FYL',
                            i: 409173,
                            l: 80,
                            p: 409171,
                            q: 1
                        }
                    ],
                    i: 409173
                },
                {
                    a: [
                        {
                            a: '01层\\01c',
                            i: 409240,
                            l: 80,
                            p: 409174,
                            q: 1
                        },
                        {
                            a: '1101\\1101',
                            i: 409244,
                            l: 48,
                            p: 409240,
                            q: 0
                        },
                        {
                            a: '1102\\1102',
                            i: 409245,
                            l: 48,
                            p: 409240,
                            q: 0
                        },
                        {
                            a: '1103\\1103',
                            i: 409246,
                            l: 48,
                            p: 409240,
                            q: 0
                        },
                        {
                            a: '1104\\1104',
                            i: 409247,
                            l: 48,
                            p: 409240,
                            q: 0
                        },
                        {
                            a: '1105\\1105',
                            i: 409248,
                            l: 48,
                            p: 409240,
                            q: 0
                        },
                        {
                            a: '1106\\1106',
                            i: 409249,
                            l: 48,
                            p: 409240,
                            q: 0
                        },
                        {
                            a: '1107\\1107',
                            i: 409250,
                            l: 48,
                            p: 409240,
                            q: 0
                        },
                        {
                            a: '1108\\1108',
                            i: 409251,
                            l: 48,
                            p: 409240,
                            q: 0
                        },
                        {
                            a: '客用电梯外走廊\\kydtwzl',
                            i: 409241,
                            l: 32,
                            p: 409240,
                            q: 0
                        },
                        {
                            a: '布草房\\bcf',
                            i: 409243,
                            l: 32,
                            p: 409240,
                            q: 0
                        },
                        {
                            a: '楼层走廊公区\\lczlgq',
                            i: 409242,
                            l: 32,
                            p: 409240,
                            q: 0
                        }
                    ],
                    i: 409240
                },
                {
                    a: [
                        {
                            a: '02层\\02c',
                            i: 409252,
                            l: 80,
                            p: 409174,
                            q: 2
                        },
                        {
                            a: '1201\\1201',
                            i: 409256,
                            l: 48,
                            p: 409252,
                            q: 0
                        },
                        {
                            a: '1202\\1202',
                            i: 409257,
                            l: 48,
                            p: 409252,
                            q: 0
                        },
                        {
                            a: '1203\\1203',
                            i: 409258,
                            l: 48,
                            p: 409252,
                            q: 0
                        },
                        {
                            a: '1204\\1204',
                            i: 409259,
                            l: 48,
                            p: 409252,
                            q: 0
                        },
                        {
                            a: '1205\\1205',
                            i: 409260,
                            l: 48,
                            p: 409252,
                            q: 0
                        },
                        {
                            a: '1206\\1206',
                            i: 409261,
                            l: 48,
                            p: 409252,
                            q: 0
                        },
                        {
                            a: '1207\\1207',
                            i: 409262,
                            l: 48,
                            p: 409252,
                            q: 0
                        },
                        {
                            a: '1208\\1208',
                            i: 409263,
                            l: 48,
                            p: 409252,
                            q: 0
                        },
                        {
                            a: '客用电梯外走廊\\kydtwzl',
                            i: 409253,
                            l: 32,
                            p: 409252,
                            q: 0
                        },
                        {
                            a: '布草房\\bcf',
                            i: 409255,
                            l: 32,
                            p: 409252,
                            q: 0
                        },
                        {
                            a: '楼层走廊公区\\lczlgq',
                            i: 409254,
                            l: 32,
                            p: 409252,
                            q: 0
                        }
                    ],
                    i: 409252
                },
                {
                    a: [
                        {
                            a: '副楼公区\\flgq',
                            i: 409264,
                            l: 80,
                            p: 409174,
                            q: 3
                        },
                        {
                            a: '客用电梯外走廊\\kydtwzl',
                            i: 409265,
                            l: 32,
                            p: 409264,
                            q: 0
                        },
                        {
                            a: '布草房\\bcf',
                            i: 409267,
                            l: 32,
                            p: 409264,
                            q: 0
                        },
                        {
                            a: '楼层走廊公区\\lczlgq',
                            i: 409266,
                            l: 32,
                            p: 409264,
                            q: 0
                        }
                    ],
                    i: 409264
                },
                {
                    a: [
                        {
                            a: '副楼通用公区\\fltygq',
                            i: 409239,
                            l: 96,
                            p: 409174,
                            q: 0
                        }
                    ],
                    i: 409239
                },
                {
                    a: [
                        {
                            a: '室外泳池\\swyc',
                            i: 409430,
                            l: 16,
                            p: 409429,
                            q: 0
                        },
                        {
                            a: '1.5m游泳池\\1.5myyc',
                            i: 409432,
                            l: 32,
                            p: 409430,
                            q: 0
                        },
                        {
                            a: '儿童池\\etc',
                            i: 409431,
                            l: 32,
                            p: 409430,
                            q: 0
                        }
                    ],
                    i: 409430
                }
            ],
            // 简化后的原数据,有4个层级,用于测试
            // originList: [
            //     {
            //         a: [
            //             {
            //                 a: '副楼\\fl',
            //                 i: 409174,
            //                 l: 272,
            //                 p: -1,
            //                 q: 0
            //             }
            //         ],
            //         i: 409174
            //     },
            //     {
            //         a: [
            //             {
            //                 a: '室外分区\\swfq',
            //                 i: 409429,
            //                 l: 528,
            //                 p: -1,
            //                 q: 0
            //             }
            //         ],
            //         i: 409429
            //     },
            //     {
            //         a: [
            //             {
            //                 a: '01层\\01c',
            //                 i: 409240,
            //                 l: 80,
            //                 p: 409174,
            //                 q: 1
            //             },
            //             {
            //                 a: '1101\\1101',
            //                 i: 409244,
            //                 l: 48,
            //                 p: 409240,
            //                 q: 0
            //             },
            //             {
            //                 a: '1102\\1102',
            //                 i: 409245,
            //                 l: 48,
            //                 p: 409240,
            //                 q: 0
            //             },
            //             {
            //                 a: '1103\\1103',
            //                 i: 409246,
            //                 l: 48,
            //                 p: 409240,
            //                 q: 0
            //             },
            //             {
            //                 a: '1104\\1104',
            //                 i: 409247,
            //                 l: 48,
            //                 p: 409240,
            //                 q: 0
            //             },
            //             {
            //                 a: '1105\\1105',
            //                 i: 409248,
            //                 l: 48,
            //                 p: 409240,
            //                 q: 0
            //             },
            //             {
            //                 a: '1106\\1106',
            //                 i: 409249,
            //                 l: 48,
            //                 p: 409240,
            //                 q: 0
            //             },
            //             {
            //                 a: '1107\\1107',
            //                 i: 409250,
            //                 l: 48,
            //                 p: 409240,
            //                 q: 0
            //             },
            //             {
            //                 a: '1108\\1108',
            //                 i: 409251,
            //                 l: 48,
            //                 p: 409240,
            //                 q: 0
            //             },
            //             {
            //                 a: '客用电梯外走廊\\kydtwzl',
            //                 i: 409241,
            //                 l: 32,
            //                 p: 409240,
            //                 q: 0
            //             },
            //             {
            //                 a: '布草房\\bcf',
            //                 i: 409243,
            //                 l: 32,
            //                 p: 409240,
            //                 q: 0
            //             },
            //             {
            //                 a: '楼层走廊公区\\lczlgq',
            //                 i: 409242,
            //                 l: 32,
            //                 p: 409240,
            //                 q: 0
            //             }
            //         ],
            //         i: 409240
            //     },
            //     {
            //         a: [
            //             {
            //                 a: '02层\\02c',
            //                 i: 409252,
            //                 l: 80,
            //                 p: 409174,
            //                 q: 2
            //             },
            //             {
            //                 a: '1201\\1201',
            //                 i: 409256,
            //                 l: 48,
            //                 p: 409252,
            //                 q: 0
            //             },
            //             {
            //                 a: '1202\\1202',
            //                 i: 409257,
            //                 l: 48,
            //                 p: 409252,
            //                 q: 0
            //             },
            //             {
            //                 a: '1203\\1203',
            //                 i: 409258,
            //                 l: 48,
            //                 p: 409252,
            //                 q: 0
            //             },
            //             {
            //                 a: '1204\\1204',
            //                 i: 409259,
            //                 l: 48,
            //                 p: 409252,
            //                 q: 0
            //             },
            //             {
            //                 a: '1205\\1205',
            //                 i: 409260,
            //                 l: 48,
            //                 p: 409252,
            //                 q: 0
            //             },
            //             {
            //                 a: '1206\\1206',
            //                 i: 409261,
            //                 l: 48,
            //                 p: 409252,
            //                 q: 0
            //             },
            //             {
            //                 a: '1207\\1207',
            //                 i: 409262,
            //                 l: 48,
            //                 p: 409252,
            //                 q: 0
            //             },
            //             {
            //                 a: '1208\\1208',
            //                 i: 409263,
            //                 l: 48,
            //                 p: 409252,
            //                 q: 0
            //             },
            //             {
            //                 a: '客用电梯外走廊\\kydtwzl',
            //                 i: 409253,
            //                 l: 32,
            //                 p: 409252,
            //                 q: 0
            //             },
            //             {
            //                 a: '布草房\\bcf',
            //                 i: 409255,
            //                 l: 32,
            //                 p: 409252,
            //                 q: 0
            //             },
            //             {
            //                 a: '楼层走廊公区\\lczlgq',
            //                 i: 409254,
            //                 l: 32,
            //                 p: 409252,
            //                 q: 0
            //             }
            //         ],
            //         i: 409252
            //     },
            //     {
            //         a: [
            //             {
            //                 a: '副楼公区\\flgq',
            //                 i: 409264,
            //                 l: 80,
            //                 p: 409174,
            //                 q: 3
            //             },
            //             {
            //                 a: '客用电梯外走廊\\kydtwzl',
            //                 i: 409265,
            //                 l: 32,
            //                 p: 409264,
            //                 q: 0
            //             },
            //             {
            //                 a: '布草房\\bcf',
            //                 i: 409267,
            //                 l: 32,
            //                 p: 409264,
            //                 q: 0
            //             },
            //             {
            //                 a: '楼层走廊公区\\lczlgq',
            //                 i: 409266,
            //                 l: 32,
            //                 p: 409264,
            //                 q: 0
            //             }
            //         ],
            //         i: 409264
            //     },
            //     {
            //         a: [
            //             {
            //                 a: '副楼通用公区\\fltygq',
            //                 i: 409239,
            //                 l: 96,
            //                 p: 409174,
            //                 q: 0
            //             }
            //         ],
            //         i: 409239
            //     },
            //     {
            //         a: [
            //             {
            //                 a: '室外泳池\\swyc',
            //                 i: 409430,
            //                 l: 16,
            //                 p: 409429,
            //                 q: 0
            //             },
            //             {
            //                 a: '1.5m游泳池\\1.5myyc',
            //                 i: 409432,
            //                 l: 32,
            //                 p: 409430,
            //                 q: 0
            //             },
            //             {
            //                 a: '儿童池\\etc',
            //                 i: 409431,
            //                 l: 32,
            //                 p: 409430,
            //                 q: 0
            //             }
            //         ],
            //         i: 409430
            //     }
            // ],

            // 拥有4层结构的数据
            // originList: [
            //     {
            //         a: [
            //             {
            //                 a: '层级1\\',
            //                 i: 1,
            //                 l: 100,
            //                 p: -1,
            //                 q: 0
            //             }
            //         ],
            //         i: 1
            //     },
            //     {
            //         a: [
            //             {
            //                 a: '层级2\\',
            //                 i: 2,
            //                 l: 80,
            //                 p: 1,
            //                 q: 1
            //             }
            //         ],
            //         i: 2
            //     },
            //     {
            //         a: [
            //             {
            //                 a: '层级3\\',
            //                 i: 3,
            //                 l: 60,
            //                 p: 2,
            //                 q: 2
            //             }
            //         ],
            //         i: 3
            //     },
            //     {
            //         a: [
            //             {
            //                 a: '层级4\\',
            //                 i: 4,
            //                 l: 40,
            //                 p: 3,
            //                 q: 3
            //             }
            //         ],
            //         i: 4
            //     }
            // ],
            searchIcon: require('../assets/icon/search.png'),
            levelOneList: [],
            levelTwoList: [],
            levelThreeList: [],
            levelFourList: [],
            listShowLevel: 0, // 0 | 1 | 2 | 3,用于展示层级页
            storageData: [], // 地址栈,点击进入下一个层级,点击的地址入栈,返回上一层级,地址出栈
            listIndex: -1, // 记录非一层级的首item所在的父级列表的index
            searchData: '', // 搜索框v-model
            beforeSearchFilterList: [], // 搜索过滤前的数据
            searchFilterList: [] // 搜索过滤后的数据
        };
    },
    methods: {
        // 搜索过滤方法
        getLastOfAfterFitlerLocation(location) {
            console.log('getLastOfAfterFitlerLocation');
            let arr = location.split('(');
            let str = arr[0];
            let arr1 = str.split(';');
            let lgth = arr1.length;
            let targetStr = arr1[lgth - 1];
            if (targetStr.indexOf(this.searchData) >= 0) return true;
            return false;
        },
        // 搜索框内容改变,过滤搜索内容
        searchChange() {
            this.searchFilterList = this.beforeSearchFilterList.filter(item => {
                return this.getLastOfAfterFitlerLocation(item);
            });
        },
        // 原始list格式化,兼容层级3和4
        categorizeData(data) {
            const categorizedArray = [];

            function processItem(item) {
                const category = {
                    a: item.a[0].a,
                    i: item.i,
                    l: item.a[0].l,
                    p: item.a[0].p,
                    q: item.a[0].q,
                    children: [],
                    listName: [] // 添加空数组的属性
                };

                if (item.a[0].p === -1) {
                    categorizedArray.push(category);
                } else {
                    const parentItem = findParent(
                        item.a[0].p,
                        categorizedArray
                    );
                    if (parentItem) {
                        parentItem.children.push(category);
                    }
                }

                if (item.a.length > 1) {
                    for (let i = 1; i < item.a.length; i++) {
                        const subCategory = {
                            a: item.a[i].a,
                            i: item.a[i].i,
                            l: item.a[i].l,
                            p: item.a[i].p,
                            q: item.a[i].q,
                            children: [],
                            listName: [] // 添加空数组的属性
                        };
                        const parentItem = findParent(
                            item.a[i].p,
                            categorizedArray
                        );
                        if (parentItem) {
                            parentItem.children.push(subCategory);
                        }
                    }
                }
            }

            function findParent(parentId, categories) {
                for (let i = 0; i < categories.length; i++) {
                    if (categories[i].i === parentId) {
                        return categories[i];
                    } else if (categories[i].children.length > 0) {
                        const parentItem = findParent(
                            parentId,
                            categories[i].children
                        );
                        if (parentItem) {
                            return parentItem;
                        }
                    }
                }
                return null;
            }

            for (let i = 0; i < data.length; i++) {
                processItem(data[i]);
            }

            return categorizedArray;
        },
        // 将存在this.storageList加工,['室外分区\\swfq', '室外泳池\\swyc', '1.5m游泳池\\1.5myyc']=>'室外分区;室外泳池;1.5m游泳池(swfq;swyc;1.5myyc)'
        convertToString(arr) {
            const names = [];
            const codes = [];

            for (let i = 0; i < arr.length; i++) {
                const item = arr[i];
                const parts = item.split('\\');
                names.push(parts[0]);
                codes.push(parts[1]);
            }

            const joinedNames = names.join(';');
            const joinedCodes = codes.join(';');
            const finalStr = `${joinedNames}(${joinedCodes})`;
            return finalStr;
        },
        // 返回上一个层级页
        back() {
            this.storageData.pop();
            this.listShowLevel -= 1;
        },
        // 保存数据并转跳到PostCheck
        saveLocation() {
            let str = this.convertToString(this.storageData);
            localStorage.setItem('location', str);
            this.$router.push({
                name: 'SpotCheck'
            });
        },
        // 将分好层级的list转化为可以搜索的区域数据数组
        transferListToSearchArr(listArr) {
            let prefix = [];
            let suffix = [];
            const finalArr = [];
            let traverse = function(arr) {
                arr.forEach((item, index, array) => {
                    let tempArr = [];
                    tempArr = item.a.split('\\');
                    prefix.push(tempArr[0]);
                    suffix.push(tempArr[1]);
                    if (item.children.length > 0) {
                        traverse(item.children);
                    } else {
                        let before = prefix.join(';');
                        let after = suffix.join(';');
                        let str = `${before}(${after})`;
                        finalArr.push(str);
                    }
                    prefix.pop();
                    suffix.pop();
                });
            };
            traverse(listArr);
            return finalArr;
        },
        // 点击item
        next(list, location, index) {
            // 记录当前层级首个item在父级数组的index
            this.listIndex = index;
            // console.log(list);
            // 数据存储和4级页面的变换逻辑,先存储,后转跳
            this.storageData.push(location);
            if (list) {
                if (this.listShowLevel === 0) {
                    this.listShowLevel += 1;
                    this.levelTwoList = list;
                } else if (this.listShowLevel === 1) {
                    this.listShowLevel += 1;
                    this.levelThreeList = list;
                    if (this.levelThreeList.length < 1) {
                        this.saveLocation();
                    }
                } else if (this.listShowLevel === 2) {
                    this.listShowLevel += 1;
                    this.levelFourList = list;
                    if (this.levelFourList.length < 1) {
                        this.saveLocation();
                    }
                } else {
                    this.saveLocation();
                }
            } else {
                this.saveLocation();
                console.log('this item have no children');
            }
        },
        // 点击搜索内容的Item,并保存数据到本地
        searchMsgClick(item) {
            localStorage.setItem('location', item);
            this.$router.push({
                name: 'SpotCheck'
            });
        },
        // 首次进入页面发送请求获取原始数据并且转化为具有层级的数组
        getList() {
            axios({
                method: 'GET',
                url: Api.InnerTestGetLocEx,
                params: {
                    aHotelId: this.$route.query.aHotelId
                }
            }).then(res => {
                // step1.获取原始List并层级化
                this.list = this.categorizeData(res.data.iNodeList);
                // step2.页面加载初始先渲染L1,给levelOneList套数据
                this.levelOneList = this.list;
                // step3.beforeSearchFilterList,将分好层级的list转化为可以搜索的区域数据数组
                this.beforeSearchFilterList = this.transferListToSearchArr(
                    this.list
                );
            });
        }
    },
    created() {
        this.getList();
    },
    activated() {
        this.storageData = []; // 
        this.listShowLevel = 0; // 展示第一层级
        this.searchData = ''; // 转跳此页清空搜索框
    }
};
</script>
<style lang="less">
.Location {
    position: absolute;
    left: 0%;
    right: 0%;
    background: white;
    height: 100vh;
    width: 100vw;
    .search {
        position: relative;
        height: 62px;
        img {
            width: 25px;
            height: 25px;
            margin-top: 20px;
            position: absolute;
            left: 6.5%;
            z-index: 9999;
        }
        input[type='search'] {
            position: absolute;
            left: 50%;
            transform: translateX(-50%);
            text-indent: 50px;
            height: 45px;
            width: 90%;
            margin: 10px 0 5px 0;
            border-radius: 5px;
            border: 1px solid #eeeeee;
        }
    }
    .search-content {
        height: 1000px;
    }
}
</style>
